{
  "name": "Darby Mitchell",
  "tagline": "Sugar-coated apparitions and tender anxieties",
  "statement": [
    "As the mind evolves from adolescence to adulthood, more truths of the human experience begin to emerge: self-doubt and the looming threat of social anxiety can evolve into a horror of jaws and teeth. To be seen by others is a unique type of fear in that it is unavoidable.",
    "My work seeks to explore and reframe these discomforts as I’ve experienced them. Each drawing serves as an isolated self-exploration of that fear and, in doing so, attempts to conquer it. Isolation, humiliation, and the fear of being perceived are present in this current body of work that depicts surreal portraiture.",
    "Framing these moments in pink creates a void of seductive, alluring space. Pink saturates, pink overwhelms, pink provides a soft cushion of flattened artificiality. Cloaked in sugar, these everyday horrors are easier to swallow with a spoonful of sweetness."
  ],
  "bio": [
    "Darby Mitchell is an artist currently living and working in South Carolina. They received their BFA from the University of North Carolina at Asheville in 2021 and are now pursuing an MFA at Clemson University.",
    "In 2023 they were awarded an Iredell Statesville Arts Education Scholarship to attend the Penland School of Craft, an immersive sabbatical that sparked a return to form and informed the current pastel-and-graphite investigations into fear, embodiment, and performance."
  ],
  "contact": {
    "email": "darbym42@gmail.com",
    "phone": "(704) 437-7979",
    "instagram": "https://www.instagram.com/darbymitchell.art",
    "location": "Based in South Carolina, USA"
  },
  "education": [
    {
      "year": "Current",
      "program": "MFA, Clemson University"
    },
    {
      "year": "2021",
      "program": "BFA, Drawing — University of North Carolina at Asheville"
    }
  ],
  "awards": [
    {
      "year": "2023",
      "title": "Iredell Statesville Arts Education Scholarship",
      "notes": "Penland School of Craft"
    },
    {
      "year": "2021",
      "title": "University Research Scholar Designation",
      "notes": "UNC Asheville"
    },
    {
      "year": "2018",
      "title": "First to Finish Study Grant",
      "notes": "UNC Asheville"
    }
  ]
}